spec/fixtures/stripe_events/invoice_paid.json

{
  "id": "evt_1QP6iGKvFeX4s4udYkC32I3j",
  "object": "event",
  "api_version": "2024-10-28.acacia",
  "created": 1732558124,
  "data": {
    "object": {
      "id": "in_1QP6g6KvFeX4s4udKbgihqJT",
      "object": "invoice",
      "account_country": "IT",
      "account_name": null,
      "account_tax_ids": null,
      "amount_due": 2000,
      "amount_paid": 2000,
      "amount_remaining": 0,
      "amount_shipping": 0,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "liability": null,
        "status": null
      },
      "automatically_finalizes_at": null,
      "billing_reason": "subscription_create",
      "charge": "ch_3QP6iEKvFeX4s4ud0O13UBNG",
      "collection_method": "send_invoice",
      "created": 1732557990,
      "currency": "eur",
      "custom_fields": null,
      "customer": "cus_RHfnYDKffI7ob7",
      "customer_address": null,
      "customer_email": "mark@white.com",
      "customer_name": "Mark White",
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [

      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [

      ],
      "description": null,
      "discount": null,
      "discounts": [

      ],
      "due_date": 1732644390,
      "effective_at": 1732558122,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1QLnPPKvFeX4s4ud/test_YWNjdF8xUUxuUFBLdkZlWDRzNHVkLF9SSGcyZTdNaHFKdVd6M1Vnb0R6dTF4cnN6Y29LOEJaLDEyMzA5ODkyNA0200LTl2Rukc?s=ap",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1QLnPPKvFeX4s4ud/test_YWNjdF8xUUxuUFBLdkZlWDRzNHVkLF9SSGcyZTdNaHFKdVd6M1Vnb0R6dTF4cnN6Y29LOEJaLDEyMzA5ODkyNA0200LTl2Rukc/pdf?s=ap",
      "issuer": {
        "type": "self"
      },
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1QP6g6KvFeX4s4udDAyFYDyX",
            "object": "line_item",
            "amount": 2000,
            "amount_excluding_tax": 2000,
            "currency": "eur",
            "description": "1 × SimpleMeals subscription (at €20.00 / month)",
            "discount_amounts": [

            ],
            "discountable": true,
            "discounts": [

            ],
            "invoice": "in_1QP6g6KvFeX4s4udKbgihqJT",
            "livemode": false,
            "metadata": {
            },
            "period": {
              "end": 1735149990,
              "start": 1732557990
            },
            "plan": {
              "id": "price_1QMbQaKvFeX4s4udng70Kivu",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1731961208,
              "currency": "eur",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "meter": null,
              "nickname": null,
              "product": "prod_RF5bHsE8eohoFm",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "pretax_credit_amounts": [

            ],
            "price": {
              "id": "price_1QMbQaKvFeX4s4udng70Kivu",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1731961208,
              "currency": "eur",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_RF5bHsE8eohoFm",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "sub_1QP6g6KvFeX4s4udFvSJLuTa",
            "subscription_item": "si_RHg25nkXFqsB46",
            "tax_amounts": [

            ],
            "tax_rates": [

            ],
            "type": "subscription",
            "unit_amount_excluding_tax": "2000"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1QP6g6KvFeX4s4udKbgihqJT/lines"
      },
      "livemode": false,
      "metadata": {
      },
      "next_payment_attempt": null,
      "number": "19863849-0095",
      "on_behalf_of": null,
      "paid": true,
      "paid_out_of_band": false,
      "payment_intent": "pi_3QP6iEKvFeX4s4ud0yDqsOvr",
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1732557990,
      "period_start": 1732557990,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering": null,
      "shipping_cost": null,
      "shipping_details": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1732558122,
        "marked_uncollectible_at": null,
        "paid_at": 1732558122,
        "voided_at": null
      },
      "subscription": "sub_1QP6g6KvFeX4s4udFvSJLuTa",
      "subscription_details": {
        "metadata": {
        }
      },
      "subtotal": 2000,
      "subtotal_excluding_tax": 2000,
      "tax": null,
      "test_clock": null,
      "total": 2000,
      "total_discount_amounts": [

      ],
      "total_excluding_tax": 2000,
      "total_pretax_credit_amounts": [

      ],
      "total_tax_amounts": [

      ],
      "transfer_data": null,
      "webhooks_delivered_at": 1732557990
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_JtKDmkq0s7uc1H",
    "idempotency_key": "aaa254f1-c116-4969-ad8b-8c1cd2828f16"
  },
  "type": "invoice.paid"
}